#!/usr/bin/env python3
# -*- coding: utf-8 -*-
# update.py
"""更新日志"""

from .mysignal import global_ms as ms


def update_record():
    """更新日志"""
    update = {
        "1.7.4":
        """新增 手动重启按钮
优化 组队/单人御魂副本任务
优化 修改工具类函数的导入形式
优化 更新下载显示
优化 御魂副本支持素材复用
优化 组队永生之海副本，支持新版结算
优化 结果判断逻辑，防止手快提前进入结算逻辑
优化 重启函数
优化 适配活动「宴场维和」
修复 关闭悬赏可能导致进程卡住问题
修复 设置-更新模式未生效的问题
修复 组队御魂中场景判定问题
修复 业原火无法挑战的问题
""",
        "1.7.3":
        """新增 更新自动重启
新增 御魂副本测试项，使用新方法识别
新增 悬赏封印关闭选项，降低程序运行功耗（需重启）
新增 单人御魂副本测试功能
优化 默认启用镜像源下载
优化 完善资源检查
优化 测试用log文件夹测试完成后自动删除
优化 更新「妖塔燃战」限时活动资源
优化 设置界面
修复 镜像源启用失败的问题
修复 匹配更新包空路径的问题
修复 资源检测线程问题""",
        "1.7.2":
        """添加 对中文路径的提示
优化 配置文件的读取优先级
修复 潜存在的路径转义问题
修复 神罚素材不全问题
新增 日志自动清理（30天）
修复 日志文件概率乱码的问题
优化 游戏窗口检测
添加 更新记录
修复 utf-8异常乱码问题
添加 对组队御魂副本时司机可能出现的bug提示
新增 御魂掉落统计beta""",
        "1.7.1":
        """优化 任务完成的表现形式
优化 系统通知保留至通知栏
添加 镜像下载源
添加 对部分素材的路径检查
适配 神罚副本""",
        "1.7.0":
        """该版本为1.7测试版
资源文件夹由 `pic` 更新为 `resource` ，尝试兼容旧资源文件夹
新增 配置文件及设置
优化 悬赏封印处理方式并添加设置项"""
    }

    for key, value in update.items():
        s: str = f"{str(key)}\n{str(value)}\n"
        ms.ui_update_record_textBrowser_update.emit(s)
